Clash Bot Workspace - Plan
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/ClashBot/ClashBot/runs/run-7Fc1Uifou4q8taxB

Waiting for the plan to start...

Terraform v1.2.4
on linux_amd64
Initializing plugins and modules...
data.aws_availability_zones.available_zones: Reading...
aws_cloudwatch_log_group.clash-bot-task-logs: Refreshing state... [id=clash-bot-discord-ecs-task-logs]
data.aws_caller_identity.current: Reading...
aws_iam_policy.clash-bot-iam-policy: Refreshing state... [id=arn:aws:iam::816923827429:policy/secrets-policy]
aws_ecs_cluster.clash-bot-ecs: Refreshing state... [id=arn:aws:ecs:us-east-1:816923827429:cluster/clash-bot-discord-ecs]
aws_iam_role.clash-bot-exec-role: Refreshing state... [id=clash-bot-discord-exec-role]
aws_iam_policy.ecr_iam_policy: Refreshing state... [id=arn:aws:iam::816923827429:policy/ecr-ecs-policy]
aws_vpc.clash-bot-vpc: Refreshing state... [id=vpc-02faa95c4fe6522d7]
data.aws_caller_identity.current: Read complete after 0s [id=816923827429]
aws_iam_policy.secrets_iam_policy: Refreshing state... [id=arn:aws:iam::816923827429:policy/ecs-secrets-policy]
aws_iam_policy.ecr_registry_iam_policy: Refreshing state... [id=arn:aws:iam::816923827429:policy/ecr-ecs-registry-policy]
data.aws_availability_zones.available_zones: Read complete after 0s [id=us-east-1]
aws_iam_policy.logs_iam_policy: Refreshing state... [id=arn:aws:iam::816923827429:policy/ecs-logs-policy]
aws_iam_role_policy_attachment.ecs-logs-policy-attachment: Refreshing state... [id=clash-bot-discord-exec-role-20220716171805718000000002]
aws_iam_role_policy_attachment.ecs-ecr-repository-policy-attachment: Refreshing state... [id=clash-bot-discord-exec-role-20220716171805722000000004]
aws_iam_role_policy_attachment.ecs-ecr-policy-attachment: Refreshing state... [id=clash-bot-discord-exec-role-20220716171805722300000005]
aws_iam_role_policy_attachment.ecs-secrets-policy-attachment: Refreshing state... [id=clash-bot-discord-exec-role-20220716171805717600000001]
aws_iam_role_policy_attachment.clash_bot_policy_attachment: Refreshing state... [id=clash-bot-discord-exec-role-20220716171805719500000003]
data.aws_iam_policy_document.clash-bot-secret-policy: Reading...
data.aws_iam_policy_document.clash-bot-secret-policy: Read complete after 0s [id=2689752830]
aws_secretsmanager_secret.one: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:816923827429:secret:TOKEN-3rTJ06]
aws_secretsmanager_secret.three: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:816923827429:secret:HEADER_KEY-CpJqE6]
aws_secretsmanager_secret.four: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:816923827429:secret:CLIENT_ID-3rTJ06]
aws_secretsmanager_secret.two: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:816923827429:secret:SERVICE_URL-CpJqE6]
aws_internet_gateway.gateway: Refreshing state... [id=igw-0c3e5757305b244ec]
aws_subnet.clash-bot-subnet-public[0]: Refreshing state... [id=subnet-09562095b00282a6c]
aws_subnet.clash-bot-subnet-private[1]: Refreshing state... [id=subnet-0db3a0cd03282879f]
aws_subnet.clash-bot-subnet-private[0]: Refreshing state... [id=subnet-0f4d11dcff9c38e33]
aws_security_group.clash-bot-discord-bot-sg: Refreshing state... [id=sg-0ec1ecd58321055e3]
aws_lb_target_group.clash-bot-discord-bot-tg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:816923827429:targetgroup/clash-bot-discord-tg/ae865354c074534d]
aws_secretsmanager_secret_version.three_version: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:816923827429:secret:HEADER_KEY-CpJqE6|FE558E88-88BD-48A3-84B0-B25115D9079A]
aws_secretsmanager_secret_version.two_version: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:816923827429:secret:SERVICE_URL-CpJqE6|9277E2EA-418F-4820-BD03-3785553E5807]
aws_subnet.clash-bot-subnet-public[1]: Refreshing state... [id=subnet-0d27f57f2e489b3a9]
aws_secretsmanager_secret_version.one_version: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:816923827429:secret:TOKEN-3rTJ06|799A062A-7D57-4865-9A5B-82EC1EF070B0]
aws_secretsmanager_secret_version.four_version: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:816923827429:secret:CLIENT_ID-3rTJ06|308616D6-2F7E-4B4F-8945-C44C419B160F]
aws_route.internet_access: Refreshing state... [id=r-rtb-06ab5d9dda06b9c861080289494]
aws_eip.clash-bot-eip-gateway[0]: Refreshing state... [id=eipalloc-0ffead36d0187bae1]
aws_eip.clash-bot-eip-gateway[1]: Refreshing state... [id=eipalloc-024ca868fa7915b63]
aws_ecs_task_definition.clash-bot-discord-bot-task-def: Refreshing state... [id=clash-bot-discord]
aws_lb.clash-bot-discord-bot-lb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:816923827429:loadbalancer/app/clash-bot-discord-lb/387b8697a6d7ee1a]
aws_security_group.clash-bot-discord-bot-task-sg: Refreshing state... [id=sg-077431d3e3d49ac90]
aws_nat_gateway.clash-bot-gateway[1]: Refreshing state... [id=nat-031baabd775225772]
aws_nat_gateway.clash-bot-gateway[0]: Refreshing state... [id=nat-08c64a5a7b0d3d34e]
aws_route_table.clash-bot-rt-private[0]: Refreshing state... [id=rtb-0c3cd07f47e622b58]
aws_route_table.clash-bot-rt-private[1]: Refreshing state... [id=rtb-0541b46f1c0a64211]
aws_lb_listener.clash-bot-discord-bot-lb-listener: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:816923827429:listener/app/clash-bot-discord-lb/387b8697a6d7ee1a/d4b3b0e022c156e9]
aws_route_table_association.clash-bot-rta-private[1]: Refreshing state... [id=rtbassoc-06b257bdf0431fae9]
aws_route_table_association.clash-bot-rta-private[0]: Refreshing state... [id=rtbassoc-0a8f5db531b080dc4]
aws_ecs_service.clash-bot-discord-bot-service: Refreshing state... [id=arn:aws:ecs:us-east-1:816923827429:service/clash-bot-discord-ecs/clash-bot-discord-service]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.clash-bot-discord-bot-service will be updated in-place
  ~ resource "aws_ecs_service" "clash-bot-discord-bot-service" {
      + force_new_deployment               = true
        id                                 = "arn:aws:ecs:us-east-1:816923827429:service/clash-bot-discord-ecs/clash-bot-discord-service"
        name                               = "clash-bot-discord-service"
        tags                               = {
            "Name" = "clash-bot-discord-ecs-service"
        }
      ~ task_definition                    = "arn:aws:ecs:us-east-1:816923827429:task-definition/clash-bot-discord:16" -> (known after apply)
        # (14 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.clash-bot-discord-bot-task-def must be replaced
-/+ resource "aws_ecs_task_definition" "clash-bot-discord-bot-task-def" {
      ~ arn                      = "arn:aws:ecs:us-east-1:816923827429:task-definition/clash-bot-discord:16" -> (known after apply)
      ~ container_definitions    = (sensitive) # forces replacement
      ~ id                       = "clash-bot-discord" -> (known after apply)
      - ipc_mode                 = "" -> null
      - pid_mode                 = "" -> null
      ~ revision                 = 16 -> (known after apply)
      ~ tags                     = {
          ~ "Release" = "v4.1.14" -> "hotfix/teamApi"
            # (1 unchanged element hidden)
        }
      ~ tags_all                 = {
          ~ "Release"     = "v4.1.14" -> "hotfix/teamApi"
            # (3 unchanged elements hidden)
        }
      - task_role_arn            = "" -> null
        # (7 unchanged attributes hidden)
    }

  # aws_iam_policy.ecr_registry_iam_policy will be updated in-place
  ~ resource "aws_iam_policy" "ecr_registry_iam_policy" {
        id          = "arn:aws:iam::816923827429:policy/ecr-ecs-registry-policy"
        name        = "ecr-ecs-registry-policy"
      ~ policy      = (sensitive)
        tags        = {}
        # (5 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

Changes to Outputs:
  ~ task_definition_version = 16 -> (known after apply)

```

</details>

*Pushed by: @Poss111, Action: `pull_request`*